[
	{
		"text": "“...so fraught with malice was the phrase ‘enemy of the people,’ that even Nikita Khrushchev forbade its use, telli… https://t.co/2VipCsNLTB",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Flake: “The free press is the despot’s enemy, which makes the free press the guardian of democracy. When a figure i… https://t.co/iCpwEuZCS5",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Flake is poised to blast Trump’s “unrelenting daily assault on the constitutionally-protected free press” that he’l… https://t.co/IW0biX1QEW",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "55% of Americans think that Trump's mental fitness is a legitimate issue. https://t.co/mrDOD0TyTu",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Mexico will leave the NAFTA negotiating table if Trump decides to trigger a 6-month process to withdraw from the tr… https://t.co/gW4YFKD6RJ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The Trump admin plans to unveil a major revision to decades-old banking rules that mandate lending to poor borrower… https://t.co/LJxLjvFFRJ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "States are pushing back on the net neutrality rollback.\n\nLawmakers in at least six states, including California and… https://t.co/vDmZ66hY5C",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump tonight to reporters: “No. I’m not a racist. I’m the least racist person you will ever interview.” (via pool report)",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Rep. Frederica Wilson says she won’t attend Trump's first State of the Union address, citing his \"recent racist and… https://t.co/zqvgGL5Vd5",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "“America is an idea, not a race,” Lindsey Graham told Trump. Diversity was a strength, he said, not a weakness. And… https://t.co/yrhjghqW3I",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "There are no pending Trump nominees for 245 of 626 top executive branch jobs, per WaPo, including: deputy secretary… https://t.co/q2LZFklAsY",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The new cover @DerSPIEGEL. https://t.co/pXhUpN3eyZ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Maxine Waters leads a group of Democrats pressing Steve Mnuchin’s Treasury Dept. to provide info relating to potent… https://t.co/HkxOP8lsDr",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Jeff Flake says he heard directly from participants in that Oval Office meeting “those words were used” by Trump, “… https://t.co/mOO092sJoL",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Nearly a year into the Trump administration, mentions of climate change have been systematically removed, altered o… https://t.co/tEAknWOiMI",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Reminder from Sept. 2017: Trump administration officials rejected a study by the Department of Health and Human Ser… https://t.co/VkTqYiq3hV",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump's Cabinet has yet to test formal plans for how to respond to a domestic missile attack, a senior admin offici… https://t.co/I1viAfPJA4",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "A growing number of Russians are coming to the U.S. to give birth. These kids will have the right to live and work… https://t.co/NEmftr1AVV",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "CBO says that a 10-year reauthorization of CHIP, the Children’s Health Insurance Plan, would save taxpayers about $… https://t.co/6eFfzWjh6v",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "\"In many districts like Darrell's and mine, having President Trump an ever-present figure is a drag on the ticket,\"… https://t.co/4xUqm8rl9x",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Elizabeth Warren and Mark Warner have introduced a bill aimed at penalizing credit reporting agencies for breaches… https://t.co/eH1YrX363h",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Front page of the Honolulu Star-Advertiser. https://t.co/yLA4lMnn9Q",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "USCIS is accepting renewal requests from DACA recipients again. https://t.co/lqJmzFEA95",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Jeff Flake is planning to slam Trump's attacks on the press on the Senate floor this week, comparing Trump's use of… https://t.co/n0TKvTKA9D",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "A 24-year-old Trump campaign worker with no relevant experience is helping lead the federal drug policy office. https://t.co/Xq7DPKRG4f",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Tapper: “Were the comments racist, do you think?”\n\nRep. Mia Love: “Well, I think they were, yes. I think they were… https://t.co/D23jjgXu6U",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Rep. John Lewis on what MLK Jr. would say today: “He would be speaking the idea that we are one people, we are one… https://t.co/pEthWjlM8z",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Rep. John Lewis: \"I, for one, will not vote on government funding until we get a deal for DACA.\" (via ABC) https://t.co/uknxbEqlfy",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "For the 4th time in 4 months, Trump administration officials have refused to let an undocumented immigrant teenager… https://t.co/KaEV3lAEfZ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Per pool, Trump has arrived at Trump International Golf Club.\n\nThis is Trump’s 93rd day at a golf club as president.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Rep. John Lewis on Trump “I think he is a racist.” https://t.co/pr2sHS8UJe",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "A company that once had financial ties to Education Sec. Betsy DeVos was one of two firms selected by the Education… https://t.co/tS6vcZfGr4",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump has sent 7 tweets and retweeted 4 tweets since the Hawaii false alarm. None have been about the Hawaii false alarm.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Democrats said they made a deal with Republicans earlier this week on immigration. Then Trump rejected it. https://t.co/6AGH35isIE",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump starts his day at Mar-a-Lago in Palm Beach, Florida.\n\nThis is Trump's 120th day at a Trump property as president.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The EPA inspector general is expanding the investigation into Scott Pruitt's travel, will now review Pruitt's recen… https://t.co/WW9UVhMoos",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "In 2016, Hillary Clinton won 51% of college-educated white women.\n \nIn 2017, on average, 66% of them disapproved of… https://t.co/1JNriFQN4j",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump has no public events tomorrow, per the W.H. schedule.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Under a new policy, prisoners in New York will lose access to new and used book shipments from unapproved mail cata… https://t.co/3Bk7eaLnMF",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "It would cost $800 million to extend the Children’s Health Insurance Program, per Vox. That’s 0.1% of the price of… https://t.co/owpi65sORx",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The Daily Beast was informed late Friday that porn star Jessica Drake is not allowed to discuss Trump on account of… https://t.co/FwBMO1FE8T",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Jacob Weisberg, editor-in-chief of the Slate Group, said that in a series of interviews with Stormy Daniels in Augu… https://t.co/NUFFwHwhOV",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump apparently blames the media for distorting his meaning, arguing his description of 'shithole' was not racist… https://t.co/kFKc4envLx",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trey Gowdy is stepping down from his role on the House Ethics Committee. https://t.co/bN09rakd7R",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump lauded delivery of F-52s to Norway this week. The planes only exist in “Call of Duty,” per WaPo. https://t.co/yWKePHvmXX",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "This is Trump’s first public statement since the Hawaii false alarm. It’s about Michael Wolff’s book. https://t.co/Co5j7fwsEH",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "NYT Editorial Board: The Hawaii false alarm “made tangible the growing fears that after decades of leaders trying t… https://t.co/dOmKdlhvO8",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Chelsea Manning has filed to run for the U.S. Senate in Maryland, according to federal election filings. https://t.co/62xpft9bui",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "A group of Haitian-American diplomats working for the State Department have written an open letter expressing their… https://t.co/OZdfXAfFRm",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The front of today’s Boston Globe. https://t.co/kgpoJ1kzkF",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Randy Bryce, the Wisconsin Democrat challenging Paul Ryan, brought in $1,200,000 in the fourth quarter of 2017, acc… https://t.co/csJCuaVCWp",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Chuck Grassley faced relentless questioning about Trump’s fitness for office and his own handling of the Russian in… https://t.co/QisSHvz1Uu",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "\"He's smart and capable at getting himself elected president,\" said Kansas Republican Sen. Jerry Moran.\n\nBut is he… https://t.co/oqxVxMAhK4",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Kentucky has made history by imposing a work requirement on the state’s Medicaid program, the first of its kind in… https://t.co/vThloJ1zSu",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The cover of today’s @NYDailyNews. https://t.co/Zhjoin9aYB",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The Federal Energy Regulatory Commission, a group dominated by Trump appointes, has unanimously rejected Rick Perry… https://t.co/Ku398nNFwL",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "This is a really fantastic thread. https://t.co/JOWWwmKFmN",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "FYI today is Korean American Day. https://t.co/v8uOLAuFRa",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Ten Senate Democrats have complained in a letter to Trump over the lack of transparency in trade negotiations by hi… https://t.co/5ZMKGQeMyx",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The front of today’s Detroit Free Press. https://t.co/bgMECq32Zs",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The Flint special prosecutor has accused four state environmental regulators of failing to protect Flint residents… https://t.co/butqzd9IRG",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "This is the President of Ghana calling out Trump. https://t.co/8FNCf5Zn7E",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "A 15-month review by the Department of Education has concluded that Texas officials illegally led schools across th… https://t.co/vuM1yv59xQ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Per pool, Trump has arrived at Trump International Golf Club.\n\nThis is his 92nd day at a golf club as president.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Democrats said they made a deal with Republicans earlier this week on immigration. Then Trump rejected it. https://t.co/IeBpzZLWnn",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "\"...in modern times, no president has been so racially insensitive and shown outright disdain for people who aren’t… https://t.co/BKRWGhAEoJ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump starts his day at Mar-a-Lago in Palm Beach, Florida.\n\nThis is Trump's 119th day at a Trump property as president.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The Trump administration has granted Deutsche Bank a waiver from punishment stemming from a criminal conviction.\n\nD… https://t.co/AKAWXdLR0f",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "I can’t believe it’s only January 12.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "NBC News reports that Trump's 2nd FISA tweet (the one trying to clean-up his position) had to be written for the pr… https://t.co/BX39vWivwH",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Georgia Republican Sen. Johnny Isakson on Trump: \"He owes the people of Haiti and all of mankind an apology.\" https://t.co/UNeBR0D9Oy",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump has no public events this weekend, per the W.H. schedule.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "El Salvador says it has sent a diplomatic protest note to the United States expressing the country's \"resounding re… https://t.co/Wijn1hCXCA",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Two days of Trump:\nAttacks FISA vote\nBacktracks on FISA attack\nRejects DACA deal\nClaims to have a “very good” relat… https://t.co/ld2v1vRa4a",
		"screen_name": "kylegriffin1"
	},
	{
		"text": ".@NewYorker’s daily cartoon, by Peter Kuper. https://t.co/evlXuiocwb",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Lawyers for Trump are expected to continue talks next week with Mueller and his team about an interview with Trump.… https://t.co/OnCeN4M31Y",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Connecticut Gov. Dannel Malloy flew the Haitian flag today at the governor's residence. https://t.co/tfZbhMI6I1",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Per pool, Trump has arrived at Mar-a-Lago in Palm Beach, Florida.\n\nThis is Trump's 118th day at a Trump property as president.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Bill Clinton on Haiti: \"They have not often had the government the people deserve, but that does not make them the… https://t.co/ssMxCK6sP7",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Mueller’s team is asking for a May 14, 2018 trial date for Paul Manafort and Rick Gates. https://t.co/ywUPrEsaNg",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Sources tell NBC News that Trump worked the phones last night, calling allies outside the W.H. to gauge reaction to… https://t.co/QviKHrBWrZ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "At a March meeting with members of the Congressional Black Caucus, a member relayed to Trump that potential welfare… https://t.co/UlJb3XlY7K",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Norwegians to Trump: \"Thanks, but no thanks.\" https://t.co/sg7pLnBmG6",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump’s D.C. hotel received a $53.6 million reduction in its 2018 assessment from the District of Columbia tax offi… https://t.co/oetHPULMqY",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "John Lewis tells MSNBC he won't be attending the State of the Union. https://t.co/6C3NTWQ7iI",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "It took the White House 22 mins. to figure out how to enable the \"listening only\" feature on a conference call on r… https://t.co/fCe8WQKrBr",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Lindsey Graham: “Following comments by the President, I said my piece directly to him yesterday. The President and… https://t.co/jgvhRrZEL5",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump asked an intel analyst “Where are you from?”\n\nShe replied, “New York.”\n\nTrump wanted to know where “your peop… https://t.co/QQ2ZHErpMp",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Michael Cohen, Trump’s lawyer, arranged a $130,000 payment to a former adult-film star a month before the 2016 elec… https://t.co/UA4vF3bXoq",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The new cover of @NewYorker. https://t.co/kLXUlPO0eu",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "More Americans move to Norway than the other way around. https://t.co/CCLxUQmk04",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "McCain: “Respect for the God-given dignity of every human being, no matter their race, ethnicity or other circumsta… https://t.co/DdCCKiPlDE",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump approval in Georgia:\n\nApprove 36.7\nDisapprove 58.7\nNET -22\nhttps://t.co/PzcEXa6dim",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump extends the Iran nuclear deal again.\nhttps://t.co/6CRfIFmFk9",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The African Union said it was \"alarmed\" by Trump's statement. \"Given the historical reality of how many Africans ar… https://t.co/9dTvxzlEuc",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Tim Scott said he talked to fellow S.C. Sen. Lindsey Graham about Trump's \"shithole countries\" comment and Graham c… https://t.co/EyQmYhVXx4",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Feinstein: “The president’s expressed desire to see more immigrants from countries like Norway must be called out f… https://t.co/Rsz9Ay41ec",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The same Russian government-aligned hackers who penetrated the Democratic Party have spent the past few months layi… https://t.co/jItzQF15IO",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Per pool: “Trump ignored a number of shouted questions as he was leaving the Roosevelt Room... One reporter asked t… https://t.co/46rsJkzvht",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Durbin doubles down: “He used those words, and he used them repeatedly. I cannot believe that in the history of the… https://t.co/y0okLysgYp",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Less than a day after Trump’s reported “shitholes” remark, he says this at an MLK day proclamation signing: “...no… https://t.co/ygH4FDohZX",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The U.S. Ambassador to Panama John Feeley has written to the State Dept. announcing his resignation, Reuters report… https://t.co/75HL7kr0K2",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "A senior Trump admin official says the top U.S. diplomat in Haiti has been summoned to meet with Haiti's president… https://t.co/64LTMFQhad",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump’s decision to cancel his London trip “was greeted with relief by London's Mayor Sadiq Khan who said Trump had… https://t.co/WK4m6iZCZu",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "“Trump condo sales that match Treasury’s characteristics of possible money laundering totaled $1.5 billion, BuzzFee… https://t.co/wy5zQcO95t",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "More than one-fifth of Trump’s U.S. condominiums have been purchased in secretive, all-cash transactions that enabl… https://t.co/EEWDMZTAQq",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Botswana is asking the U.S. to clarify whether it’s considered a “shithole” country. (via @BWGovernment) https://t.co/zDHdc7BuWK",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Durbin goes on the record, says Trump “said things which were hate-filled, vile, and racist... I've seen the commen… https://t.co/vY5vy2iBTV",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Paul Ryan spent 30 minutes on the phone with Trump explaining the differences between domestic and foreign surveill… https://t.co/ex5SWdVeA9",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The president should definitely record all future meetings. https://t.co/iNlkLeLhJq",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "U.N. human rights office: Trump's \"shocking and shameful\" remark \"legitimizes the targeting of people based on who… https://t.co/92uvEw7Ins",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "PARIS (AP) — Cybersecurity firm says Russia-linked hackers are laying groundwork to spy on US Senate staff",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Congress passed a bill guaranteeing military pay during the 2013 shutdown. https://t.co/RrmtsvAKPR https://t.co/De9SnQRji0",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Reminder that the White House didn’t deny yesterday that Trump said his “shithole” remark. https://t.co/bPNaWTgkAD",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump 3 days ago: “My positions are going to be what the people in this room come up with... If they come to me wit… https://t.co/sTA61ASRmQ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "In light of Trump's \"shithole\" comments, it should be noted that today is the 8th anniversary of the earthquake in Haiti.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The first piece of legislation Doug Jones is sponsoring is the reauthorization of CHIP, the Children's Health Insur… https://t.co/1XbZKiFtZ3",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump canceled an international trip to celebrate an embassy opening with our closest ally because the new embassy… https://t.co/soIWS80hVj",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The former Prime Minister of Haiti calls out Trump. https://t.co/Pt26JI9tq8",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "My phone is currently in my hand and I’m checking Twitter. Just now, I thought to myself, ‘I should take out my pho… https://t.co/r9joNy41kg",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Joe Scarborough: \"There can be no compromise or middle ground between those who defend the Constitution and a presi… https://t.co/30nKW1tUit",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The White House has just released its daily guidance and press schedule for tomorrow. There's no press briefing on the agenda.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump is tweeting at Fox and Friends more than 13 hours after the show ended this morning. https://t.co/JpWdGfYf4m",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "NAACP: \"This President’s failure to grasp simple ideas of inclusion and maturity is an open sore on our democracy t… https://t.co/eCeVctEXrO",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump has backed off the idea of visiting Britain next month to open the new U.S. embassy in London amid fears of m… https://t.co/Zb7dPDX31e",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "A group of more than 70 psychologists, psychiatrists and mental health professionals sent a letter to Trump’s physi… https://t.co/DjQvHgQpEO",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Congressional Black Caucus: \"The President’s slogan Make America Great Again is really code for Make America White… https://t.co/Am65jN8qvb",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The cover of tomorrow’s @NYDailyNews. https://t.co/vqbTcBrnXd",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Corey Lewandowski is scheduled to take questions next week from congressional investigators looking into possible c… https://t.co/1XEMnA4GrR",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Strong words from Republican Rep. Mia Love on Trump’s remarks. She says Trump “must apologize.” https://t.co/I9ryUB0CQm",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Hatch says he wants a \"more detailed explanation\" of what Trump meant by \"shithole countries\", https://t.co/3HLXb0EcPR",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Sen. Richard Blumenthal responds to Trump's \"shithole countries\" remark to @AriMelber: \"Smacks of blatant racism. T… https://t.co/7IWjANfbzC",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "It's only January 11.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Sources tell NYT that when Trump heard that Haitians were among those who would benefit from a proposed immigration… https://t.co/0xOtq34Jd2",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "NBC News has confirmed Trump's \"shithole countries\" remark with a Democratic aide briefed on the meeting.\nhttps://t.co/qByssFQBaV",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The White House doesn't deny Trump said his \"shithole countries\" remark. https://t.co/JWpF3Rwl0Y",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Reminder of this report last month: During a June meeting, Trump said Haitians “all have AIDS,” one person who atte… https://t.co/BVK2iRYlTI",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "\"He then suggested that the U.S. should instead bring more people from Norway and other similar countries, whose pr… https://t.co/jsDMPVCjEq",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "During immigration negotiations in the Oval Office, WaPo reports Trump said: “Why are we having all these people fr… https://t.co/bYTvjDhaSk",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump says to WSJ that the text messages traded between Peter Strzok and Lisa Page amounted to treason. https://t.co/RU6jbYvGrs",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump, once again, says that \"Fire and Fury\" shows the need for new libel laws. But then tells WSJ it's unlikely to… https://t.co/JDPlcEwLQZ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Steve Bannon will be interviewed next week by a House committee investigating Russia, a person familiar with the ma… https://t.co/JKdWasX7Gq",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Dick Durbin says the bipartisan working group of senators has reached a deal on immigration \"in principle\" (includi… https://t.co/OZbxikpDmD",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Adam Schiff says there are dozens of witnesses he would like called before the House Intel Committee, including Iva… https://t.co/RbnH9INq53",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Hours after Walmart announced it was giving raises and bonuses to employees, Walmart told Business Insider it’s abr… https://t.co/tpoOIVLLaz",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "@Kyle_Feldscher The pool appears to be incorrect then. But I’m going back to listen again.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump just now on his upcoming physical: \"It better go well otherwise the stock market will not be happy.\"",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Roy Cooper asks the Trump administration for an offshore exemption for North Carolina like the one granted to Flori… https://t.co/FBXHGQjuK3",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump is turned off by Kate McKinnon’s portrayal of Jeff Sessions on SNL, advisers tell WaPo. A senior White House… https://t.co/zyybiohnrJ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "17 Democratic members of the Oversight Committee are pushing committee chair Trey Gowdy to launch a “serious invest… https://t.co/qNJ3LObOYV",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Darrell Issa has been discussing with colleagues the possibility of running in a neighboring San Diego district if… https://t.co/LptOgbmVUb",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "“When the history of President Donald Trump’s use of Twitter is written, there will be a stiff competition for his… https://t.co/IW0qp9Ta4J",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Democrats have a 17-point edge on a generic congressional ballot in the new Q poll. That’s up 2-points from last mo… https://t.co/frI4zVHZ3J",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "FBI investigators have not so far requested an interview with Mike Pence, a person familiar with the matter tells N… https://t.co/cidSqIFweF",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The House has passed the six year FISA reauthorization 256-164.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "“Per a source close to Republican leaders: ‘I have decided that the only way to stay sane in Trump’s Washington is… https://t.co/eMO6zSshhC",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "@ComfortablySmug I applaud your opportunism.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "@ComfortablySmug Are you OK? I think there’s something in your water.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Steve Bannon is lawyering up, The Daily Beast reports. https://t.co/2ucm2tBTRt",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Gov-elect Ralph Northam formally asks the Trump administration for an offshore exemption for Virginia like the one… https://t.co/wQekP7Pu9h",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Schiff: “In light of the irresponsible and inherently contradictory messages coming out of the W.H. today, I would… https://t.co/WB51lMj3R5",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The cover of @TheEconomist. https://t.co/HSXqbBjV5e",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "More than 90-minutes later, Trump walks back his tweet contradicting the W.H. position on FISA. https://t.co/Z6fsaZjnwk",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Ralph Northam announced the last of 15 Cabinet picks earlier this week, assembling what his office says would be th… https://t.co/QDrHI6OE9o",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The Trump administration will allow states to impose Medicaid work requirements. \n\nStates could cut off Medicaid be… https://t.co/chEkQykCBH",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The new cover of @TIME. https://t.co/EoCjcatYFZ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The White House issued a statement less than 12 hours ago supporting FISA and opposing the amendment that would blo… https://t.co/xsWU1PkeQ9",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "In this same poll, more people credit Obama for the good economy than Trump 49%-40% https://t.co/cUHZk06nJp https://t.co/bOkYaC3C44",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Some other numbers from that same Q poll.\n\nGrading Trump's first year in office:\n56% - D or F\n11% - C\n16% - B\n16% -… https://t.co/nJxdcmd0gI",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "More than 100 corporate leaders are calling on Congress to pass legislation by Janurary 19 to protect the status of… https://t.co/idJ2BccPoX",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Russian tycoon Oleg Deripaska has filed suit in New York State Court against Paul Manafort and Rick Gates, claiming… https://t.co/9J8GJWuBB3",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Republican Missouri Gov. Eric Greitens confims to local media that he had an extramarital affair; a woman alleges t… https://t.co/ByGWXkti8C",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Sure. Why not. https://t.co/JAHqmgyLnd",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Here's the first clip from President Obama's first talk show appearance since leaving office, on Letterman's new Ne… https://t.co/TDYr20sBQB",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "June 2017\nQ: Would you be willing to speak under oath to give your version of those events?\nTRUMP: 100%\n\nJanuary 20… https://t.co/H3YTeyAwsF",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The Trump administration has ended a national registry designed to provide information to the public about evidence… https://t.co/VYvvUK2zfg",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Carrier has announced that 215 workers will lose their jobs at its Indianapolis plant this week, the last of about… https://t.co/ZIqgMOWWSR",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Democratic House members are planning to invite victims of sexual assault to Trump's State of the Union address lat… https://t.co/UXQ1LTaEfS",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Ex-CIA counterterrorism analyst: Foreign spies are likely watching Fox News and probably targeting “on-air talent,… https://t.co/kbHU1nAdnB",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The top Democrats on six House committees—Foreign Affairs, Financial Services, Judiciary, Homeland Security, Oversi… https://t.co/1CBMO3iQM8",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Kirsten Gillibrand plans to try to block the confirmation of Geoffrey S. Berman if he's nominated by Trump as the U… https://t.co/GZm0Vyl3mq",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "A telemarketing company whose clients have included a pro-Trump PAC, Ben Carson's 2016 presidential committee, and… https://t.co/ilwnYqtwRu",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "\"President Donald Trump’s negligence in acknowledging and responding to the threat of continued Russian interferenc… https://t.co/8zLzkIQmVQ",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The U.S. still lacks “a coherent, comprehensive and coordinated approach” to countering potential future threats fr… https://t.co/psCFRgLJ16",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The Supreme Court is taking up a Navy vet's challenge to the voter purge system Ohio’s Republican Sec. of State use… https://t.co/f6exgCsU40",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The Interior Department has adopted a new screening process for the discretionary grants it makes to outside groups… https://t.co/2lcB327zlj",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The EPA is now re-evaluating a 2015 rule that tightened safety standards for farmworkers. In particular, the agency… https://t.co/XGOVA5E9IE",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Grading Trump's first year in office:\n56% - D or F\n11% - C\n16% - B\n16% - A\n\n66% say the Trump presidency has damage… https://t.co/q7Q9yIm4yh",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Canada is increasingly convinced that Trump will soon announce that the United States intends to pull out of the NA… https://t.co/8Su1VtB3gD",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "\"There are now 31 Republicans who will not seek re-election in November: 19 who are retiring outright and another 1… https://t.co/r0GFqW5Tk2",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "It's been 428 days since the election and Trump continues to bring up Hillary Clinton in this press conference.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "@CahnEmily It's 2018 and we're still talking about 2016.",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Trump, without providing any evidence: \"There is collusion, but it is really with the Democrats and the Russians fa… https://t.co/819aU0NKA6",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "The FBI has released two internal documents from the week of Comey’s firing. One is a statement from Sessions annou… https://t.co/FWcfMQFuuz",
		"screen_name": "kylegriffin1"
	},
	{
		"text": "Mueller has added a veteran cyber prosecutor to his team, filling a gap in expertise and potentially signaling a fo… https://t.co/ycU2uBgrYe",
		"screen_name": "kylegriffin1"
	}
]