[
	{
		"text": "Senator Dicky Durbin totally misrepresented what was said at the DACA meeting. Deals can’t get made when there is n… https://t.co/YaPbD8cjHe",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "...to stop drugs, they want to take money away from our military which we cannot do.” My standard is very simple, A… https://t.co/Q3BJnCHTLv",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Statement by me last night in Florida: “Honestly, I don’t think the Democrats want to make a deal. They talk about… https://t.co/L3CS8EO9D9",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "...big unnecessary regulation cuts made it all possible” (among many other things). “President Trump reversed the p… https://t.co/wnLrQrTsWp",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "“President Trump is not getting the credit he deserves for the economy. Tax Cut bonuses to more than 2,000,000 work… https://t.co/0US33d7EuY",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "I, as President, want people coming into our Country who are going to help us become strong and great again, people… https://t.co/IkpH8hauTL",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "DACA is probably dead because the Democrats don’t really want it, they just want to talk and take desperately neede… https://t.co/gZRLa3KopW",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "...and they knew exactly what I said and meant. They just wanted a story. FAKE NEWS!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Wall Street Journal stated falsely that I said to them “I have a good relationship with Kim Jong Un” (of N. Kor… https://t.co/ZvyN9rhbFn",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "So much Fake News is being reported. They don’t even try to get it right, or correct it when they are wrong. They p… https://t.co/O5Mqd6avqH",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "I don’t believe the Democrats really want to see a deal on DACA. They are all talk and no action. This is the time… https://t.co/K5o4njHvXx",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "AMERICA FIRST!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Democrats are all talk and no action. They are doing nothing to fix DACA. Great opportunity missed. Too bad!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Yesterday was a big day for the stock market. Jobs are coming back to America. Chrysler is coming back to the USA,… https://t.co/0BKC8RejRA",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Today, it was my great honor to proclaim January 15, 2018, as Martin Luther King Jr., Federal Holiday. I encourage… https://t.co/HMoyGfAZLJ",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Never said anything derogatory about Haitians other than Haiti is, obviously, a very poor and troubled country. Nev… https://t.co/HivKR2wF8g",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Sadly, Democrats want to stop paying our troops and government workers in order to give a sweetheart deal, not a fa… https://t.co/jivCaE5vpb",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The language used by me at the DACA meeting was tough, but this was not the language used. What was really tough wa… https://t.co/8PvNzf41G4",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "....Because of the Democrats not being interested in life and safety, DACA has now taken a big step backwards. The… https://t.co/YzEuBuYGrs",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "....countries which are doing badly. I want a merit based system of immigration and people who will help take our c… https://t.co/QfbeeEN6qP",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The so-called bipartisan DACA deal presented yesterday to myself and a group of Republican Senators and Congressmen… https://t.co/5s50JXBumv",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Reason I canceled my trip to London is that I am not a big fan of the Obama Administration having sold perhaps the… https://t.co/9crSrOBXme",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Democrats seem intent on having people and drugs pour into our country from the Southern Border, risking thousa… https://t.co/D0kxlMJhLq",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Democrat Dianne Feinstein should never have released secret committee testimony to the public without authorization… https://t.co/02erkjcPHU",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Chrysler is moving a massive plant from Mexico to Michigan, reversing a years long opposite trend. Thank you Chrysl… https://t.co/yxTLic66pf",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "More great news as a result of historical Tax Cuts and Reform: Fiat Chrysler announces plan to invest more than $1… https://t.co/K7893jxDWC",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Small Business Poll has highest approval numbers in the polls history. All business is just at the beginning of something really special!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Thank you Adam Levine, The Federalist, in interview on @foxandfriends  “Donald Trump is the greatest President our Country has ever seen.”",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Yesterday, I signed the #INTERDICTAct (H.R. 2142) with bipartisan members of Congress to help end the flow of drugs… https://t.co/7gjyeEu1HY",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Great news, as a result of our TAX CUTS &amp; JOBS ACT! https://t.co/SLvhLxP3Jl",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "With that being said, I have personally directed the fix to the unmasking process since taking office and today’s v… https://t.co/yvJkaKTGEr",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "“45 year low in illegal immigration this year.” @foxandfriends",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "“House votes on controversial FISA ACT today.” This is the act that may have been used, with the help of the discre… https://t.co/PMLpbrd3pp",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "In new Quinnipiac Poll, 66% of people feel the economy is “Excellent or Good.” That is the highest number ever recorded by this poll.",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Disproven and paid for by Democrats “Dossier used to spy on Trump Campaign. Did FBI use Intel tool to influence the… https://t.co/5nl0H317BJ",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Good news: Toyota and Mazda announce giant new Huntsville, Alabama, plant which will produce over 300,000 cars and… https://t.co/p9dtyrd5Be",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Cutting taxes and simplifying regulations makes America the place to invest! Great news as Toyota and Mazda announc… https://t.co/aEV6VyZOMH",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The United States needs the security of the Wall on the Southern Border, which must be part of any DACA approval. T… https://t.co/1BWcwPlyu2",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Today, it was my great honor to welcome Prime Minister Erna Solberg of Norway to the @WhiteHouse - a great friend a… https://t.co/mWiclVf7KA",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "I want to thank my @Cabinet for working tirelessly on behalf of our country. 2017 was a year of monumental achievem… https://t.co/XgDJxgWCnx",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The single greatest Witch Hunt in American history continues. There was no collusion, everybody including the Dems… https://t.co/j7rc1QKCLw",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The fact that Sneaky Dianne Feinstein, who has on numerous occasions stated that collusion between Trump/Russia has… https://t.co/o5FAEfhS7N",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "It just shows everyone how broken and unfair our Court System is when the opposing side in a case (such as DACA) al… https://t.co/sXFgY5c11s",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": ".@ICEgov HSI agents and ERO officers, on behalf of an entire Nation, THANK YOU for what you are doing 24/7/365 to k… https://t.co/yN90uqG6z8",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Thank you @GOPLeader Kevin McCarthy! Couldn’t agree w/you more. TOGETHER, we are #MAGA🇺🇸 https://t.co/QaxtqpyXTR",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "As I made very clear today, our country needs the security of the Wall on the Southern Border, which must be part of any DACA approval.",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Today, it was my great honor to sign a new Executive Order to ensure Veterans have the resources they need as they… https://t.co/LuZk37y8SI",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Thanks to all of the Republican and Democratic lawmakers for today’s very productive meeting on immigration reform.… https://t.co/xs0FXqhkVF",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "It was my great honor to sign H.R. 267, the “Martin Luther King, Jr. National Historical Park Act,” which redesigna… https://t.co/n68lkuvsWe",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "On behalf of the American people, THANK YOU to our incredible law enforcement officers. As President of the United… https://t.co/280ORusJ3N",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "We are fighting for our farmers, for our country, and for our GREAT AMERICAN FLAG. We want our flag respected - and… https://t.co/f8u0wFpaHI",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "In every decision we make, we are honoring America’s PROUD FARMING LEGACY. Years of crushing taxes, crippling regs,… https://t.co/biAoH3zNuZ",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "We have been working every day to DELIVER for America’s Farmers just as they work every day to deliver FOR US.… https://t.co/KgNbFtg7XB",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Can’t wait to be back in the amazing state of Tennessee to address the 99th American @FarmBureau Federation’s Annua… https://t.co/UxBD2DBv2G",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "African American unemployment is the lowest ever recorded in our country. The Hispanic unemployment rate dropped a… https://t.co/1SJ1vHcqfI",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "...Clinton in the WH, doubling down on Barack Obama’s failed policies, washes away any doubts that America made the… https://t.co/e3TjsBYrtb",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "“His is turning out to be an enormously consequential presidency. So much so that, despite my own frustration over… https://t.co/u5Zn5BjFu1",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Stock Market has been creating tremendous benefits for our country in the form of not only Record Setting Stock… https://t.co/ztq2hDJ7rr",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Fake News Awards, those going to the most corrupt &amp; biased of the Mainstream Media, will be presented to the lo… https://t.co/MFPjW1foo3",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Jake Tapper of Fake News CNN just got destroyed in his interview with Stephen Miller of the Trump Administration. W… https://t.co/eIIiydV1hR",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "I’ve had to put up with the Fake News from the first day I announced that I would be running for President. Now I h… https://t.co/Y5wqMu8WzA",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Leaving Camp David for the White House. Great meetings with the Cabinet and Military on many very important subject… https://t.co/HHQLScpuHt",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "....to President of the United States (on my first try). I think that would qualify as not smart, but genius....and… https://t.co/X3UO2xDvEv",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "....Actually, throughout my life, my two greatest assets have been mental stability and being, like, really smart.… https://t.co/G3374En0XQ",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Now that Russian collusion, after one year of intense study, has proven to be a total hoax on the American public,… https://t.co/3RTHPrrh6n",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Brian Ross, the reporter who made a fraudulent live newscast about me that drove the Stock Market down 350 points (… https://t.co/Cbz6nDw2l8",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The African American unemployment rate fell to 6.8%, the lowest rate in 45 years. I am so happy about this News! An… https://t.co/CEEM2l6YHv",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Michael Wolff is a total loser who made up stories in order to sell this really boring and untruthful book. He used… https://t.co/sk2TeLbqjo",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Good idea Rand! https://t.co/55sqUDiC0s",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Mercer Family recently dumped the leaker known as Sloppy Steve Bannon. Smart!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Well, now that collusion with Russia is proving to be a total hoax and the only collusion is with Hillary Clinton a… https://t.co/9hkgQun4vG",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Dow goes from 18,589 on November 9, 2016, to 25,075 today, for a new all-time Record. Jumped 1000 points in last 5… https://t.co/16TbOsy4Ri",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Fake News Media barely mentions the fact that the Stock Market just hit another New Record and that business in… https://t.co/skkiYt1Qj2",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "I authorized Zero access to White House (actually turned him down many times) for author of phony book! I never spo… https://t.co/G8tBCceHUy",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "MAKING AMERICA GREAT AGAIN! https://t.co/iONbr1DkVk",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Thank you to the great Republican Senators who showed up to our mtg on immigration reform. We must BUILD THE WALL,… https://t.co/zKHX30vUMI",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Dow just crashes through 25,000. Congrats! Big cuts in unnecessary regulations continuing.",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "So beautiful....Show this picture to the NFL players who still kneel! https://t.co/tJLM1tvbvb",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "With all of the failed “experts” weighing in, does anybody really believe that talks and dialogue would be going on… https://t.co/EfxwZcRmLZ",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "As Americans, you need identification, sometimes in a very strong and accurate form, for almost everything you do..… https://t.co/rjfQAe1jUJ",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Many mostly Democrat States refused to hand over data from the 2016 Election to the Commission On Voter Fraud. They… https://t.co/1IuVCra2M1",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "MAKE AMERICA GREAT AGAIN!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Stock Market had another good day but, now that the Tax Cut Bill has passed, we have tremendous upward potential. D… https://t.co/nTAj1FDp2U",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "“Some 40 U.S. companies have responded to President Trump’s tax cut and reform victory in Congress last year by han… https://t.co/98ZTvwf2Pe",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Melania and I are deeply saddened by the death of Thomas S. Monson, a beloved President of the Church of Jesus Chri… https://t.co/Pge01Ug6cX",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Such respect for the people of Iran as they try to take back their corrupt government. You will see great support f… https://t.co/MhHkcH2s2A",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "“President Trump has something now he didn’t have a year ago, that is a set of accomplishments that nobody can deny… https://t.co/Cy24ZYUpBg",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "I will be announcing THE MOST DISHONEST &amp; CORRUPT MEDIA AWARDS OF THE YEAR on Monday at 5:00 o’clock. Subjects will… https://t.co/Kzvk4ErSno",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "...peace treaty with Israel. We have taken Jerusalem, the toughest part of the negotiation, off the table, but Isra… https://t.co/on5fwpqknG",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "It's not only Pakistan that we pay billions of dollars to for nothing, but also many other countries, and others. A… https://t.co/noRSzexXDg",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Congratulations to Senator Orrin Hatch on an absolutely incredible career. He has been a tremendous supporter, and… https://t.co/lhwHKYWFIl",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "We will not rest until all of America’s GREAT VETERANS can receive the care they so richly deserve. Tremendous prog… https://t.co/mk6RKy3ccj",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Democrats are doing nothing for DACA - just interested in politics.  DACA activists and Hispanics will go hard agai… https://t.co/gOK09nR4M3",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "....impartial journalists of a much higher standard, lose all of your phony and non-existent “sources,” and treat t… https://t.co/4IQrWqQMXh",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Failing New York Times has a new publisher, A.G. Sulzberger. Congratulations! Here is a last chance for the Tim… https://t.co/iTRZfE0joC",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Since taking office I have been very strict on Commercial Aviation. Good news - it was just reported that there wer… https://t.co/jfJxEvzBd3",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Sanctions and “other” pressures are beginning to have a big impact on North Korea. Soldiers are dangerously fleeing… https://t.co/lFl6Gb81V7",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Companies are giving big bonuses to their workers because of the Tax Cut Bill. Really great!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Thank you to Brandon Judd of the National Border Patrol Council for your kind words on how well we are doing at the… https://t.co/tmH3s3Q91a",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Crooked Hillary Clinton’s top aid, Huma Abedin, has been accused of disregarding basic security protocols. She put… https://t.co/TAM3Zf9ovm",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The people of Iran are finally acting against the brutal and corrupt Iranian regime. All of the money that Presiden… https://t.co/AjDsIsx0Gk",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Will be leaving Florida for Washington (D.C.) today at 4:00 P.M. Much work to be done, but it will be a great New Year!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Iran is failing at every level despite the terrible deal made with them by the Obama Administration. The great Iran… https://t.co/DaPjy8hPH5",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The United States has foolishly given Pakistan more than 33 billion dollars in aid over the last 15 years, and they… https://t.co/TuiaWGtnbR",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "HAPPY NEW YEAR! We are MAKING AMERICA GREAT AGAIN, and much faster than anyone thought possible!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "As our Country rapidly grows stronger and smarter, I want to wish all of my friends, supporters, enemies, haters, a… https://t.co/irAgm3wwEU",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Iran, the Number One State of Sponsored Terror with numerous violations of Human Rights occurring on an hourly basi… https://t.co/EHq72J2QaP",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "What a year it’s been, and we're just getting started. Together, we are MAKING AMERICA GREAT AGAIN! Happy New Year!! https://t.co/qsMNyN1UJG",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "My deepest condolences to the victims of the terrible shooting in Douglas County @DCSheriff, and their families. We… https://t.co/nhI3wsUInj",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Why would smart voters want to put Democrats in Congress in 2018 Election when their policies will totally kill the… https://t.co/u7zgBWSLMY",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "If the Dems (Crooked Hillary) got elected, your stocks would be down 50% from values on Election Day. Now they have… https://t.co/eJOxPGScHK",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Big protests in Iran. The people are finally getting wise as to how their money and wealth is being stolen and squa… https://t.co/3AhXkVG6Lh",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "“Trump Rally: Stocks put 2017 in the record books” https://t.co/0foQGaFjMh",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Jobs are kicking in and companies are coming back to the U.S. Unnecessary regulations and high taxes are being dram… https://t.co/ts9xxdjQzU",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "I use Social Media not because I like to, but because it is the only way to fight a VERY dishonest and unfair “pres… https://t.co/1YTuk89nmu",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "On Taxes: “This is the biggest corporate rate cut ever, going back to the corporate income tax rate of roughly 80 y… https://t.co/xTHIVribyK",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Oppressive regimes cannot endure forever, and the day will come when the Iranian people will face a choice. The wor… https://t.co/efPOuFh5fT",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The entire world understands that the good people of Iran want change, and, other than the vast military power of t… https://t.co/oJmf2sgH6y",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Many reports of peaceful protests by Iranian citizens fed up with regime’s corruption &amp; its squandering of the nati… https://t.co/bL9JMWQ6bZ",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Democrats have been told, and fully understand, that there can be no DACA without the desperately needed WALL a… https://t.co/sjkgrE1kQe",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Why is the United States Post Office, which is losing many billions of dollars a year, while charging Amazon and ot… https://t.co/fHKlK5bmUe",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "While the Fake News loves to talk about my so-called low approval rating, @foxandfriends just showed that my rating… https://t.co/u3cMWTck6M",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "In the East, it could be the COLDEST New Year’s Eve on record. Perhaps we could use a little bit of that good old G… https://t.co/tCjF8xdXep",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Together, we are MAKING AMERICA GREAT AGAIN! https://t.co/OeyTdFyl1Q https://t.co/wdLQkfdy4m",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "I've been saying it for a long, long time. #NoKo https://t.co/LQl7tGhMdO",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Caught RED HANDED - very disappointed that China is allowing oil to go into North Korea. There will never be a frie… https://t.co/aIa4CFXNoA",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Retail sales are at record numbers. We’ve got the economy going better than anyone ever dreamt - and you haven’t seen anything yet!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Vanity Fair, which looks like it is on its last legs, is bending over backwards in apologizing for the minor hit th… https://t.co/Sx6AmzfKRp",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "“Arrests of MS-13 Members, Associates Up 83% Under Trump” \nhttps://t.co/70iPHy2Yqn",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "“On 1/20 - the day Trump was inaugurated - an estimated 35,000 ISIS fighters held approx 17,500 square miles of ter… https://t.co/xnR1mXhmr3",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Just left West Palm Beach Fire &amp; Rescue #2. Met with great men and women as representatives of those who do so much… https://t.co/UK0Q7BUKbj",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "All signs are that business is looking really good for next year, only to be helped further by our Tax Cut Bill. Wi… https://t.co/f37VETYLej",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "WOW, @foxandfrlends  “Dossier is bogus. Clinton Campaign, DNC funded Dossier. FBI CANNOT (after all of this time) V… https://t.co/3Lv4EhnuwV",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Based on the fact that the very unfair and unpopular Individual Mandate has been terminated as part of our Tax Cut… https://t.co/sZ3YczC3mR",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "I hope everyone is having a great Christmas, then tomorrow it’s back to work in order to Make America Great Again (… https://t.co/JJ2tiWwe9V",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "MERRY CHRISTMAS!!! https://t.co/mYtV5GNdLl",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "MERRY CHRISTMAS!! https://t.co/xa2qxcisVV",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "People are proud to be saying Merry Christmas again. I am proud to have led the charge against the assault of our c… https://t.co/TDmO0lcYHA",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Tax Cut/Reform Bill, including Massive Alaska Drilling and the Repeal of the highly unpopular Individual Mandat… https://t.co/KgKnGzK6md",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Fake News refuses to talk about how Big and how Strong our BASE is. They show Fake Polls just like they report… https://t.co/hNmVwpHtM1",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": ".@FoxNews-FBI’s Andrew McCabe, “in addition to his wife getting all of this money from M (Clinton Puppet), he was u… https://t.co/fRprD7LwtJ",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Remember, the Republicans are 5-0 in Congressional races this year. In Senate, I said Roy M would lose in Alabama a… https://t.co/5IMirkPYFR",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Stock Market is setting record after record and unemployment is at a 17 year low. So many things accomplished b… https://t.co/bctmAtxwb2",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Wow, “FBI lawyer James Baker reassigned,” according to @FoxNews.",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "FBI Deputy Director Andrew McCabe is racing the clock to retire with full benefits. 90 days to go?!!!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "How can FBI Deputy Director Andrew McCabe, the man in charge, along with leakin’ James Comey, of the Phony Hillary… https://t.co/9vYPo8QMbI",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Remember, the most hated part of ObamaCare is the Individual Mandate, which is being terminated under our just signed Tax Cut Bill.",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Today, it was my great honor to sign the largest TAX CUTS and reform in the history of our country. Full remarks:… https://t.co/1plwmP1SX9",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The United Nations Security Council just voted 15-0 in favor of additional Sanctions on North Korea. The World wants Peace, not Death!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Congressman Ron DeSantis is a brilliant young leader, Yale and then Harvard Law, who would make a GREAT Governor of… https://t.co/T3T1ayf1Vh",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "95% of Americans will pay less or, at worst, the same amount of taxes (mostly far less). The Dems only want to raise your taxes!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Will be signing the biggest ever Tax Cut and Reform Bill in 30 minutes in Oval Office. Will also be signing a much… https://t.co/fgGbqDb0wg",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "With all my Administration has done on Legislative Approvals (broke Harry Truman’s Record), Regulation Cutting, Jud… https://t.co/CukTyBYh5K",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "“The President has accomplished some absolutely historic things during this past year.” Thank you Charlie Kirk of T… https://t.co/M7G4m0QqmO",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "At some point, and for the good of the country, I predict we will start working with the Democrats in a Bipartisan… https://t.co/YVl8tAcSOk",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "So true! https://t.co/1c8hu6O5t9",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Our big and very popular Tax Cut and Reform Bill has taken on an unexpected new source of “love” - that is big comp… https://t.co/jnCQYxYQBh",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "THANK YOU to everyone who joined me at the @WhiteHouse yesterday. Together, we are MAKING AMERICA GREAT AGAIN!… https://t.co/aykO3m2rVg",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "House Democrats want a SHUTDOWN for the holidays in order to distract from the very popular, just passed, Tax Cuts.… https://t.co/NRQRR8w3pp",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Home Sales hit BEST numbers in 10 years! MAKE AMERICA GREAT AGAIN",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Was @foxandfriends just named the most influential show in news? You deserve it - three great people! The many Fake… https://t.co/43JVSDZSt6",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Massive Tax Cuts, which the Fake News Media is desperate to write badly about so as to please their Democrat bo… https://t.co/9RZmBbjPQo",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "WE ARE MAKING AMERICA GREAT AGAIN! https://t.co/HY353gXV0R",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "We are delivering HISTORIC TAX RELIEF for the American people!\n#TaxCutsandJobsAct https://t.co/lLgATrCh5o",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Together, we are MAKING AMERICA GREAT AGAIN! https://t.co/47k9i4p3J2",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "I would like to congratulate @SenateMajLdr on having done a fantastic job both strategically &amp; politically on the p… https://t.co/XkEvQ5GTGi",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The Tax Cuts are so large and so meaningful, and yet the Fake News is working overtime to follow the lead of their… https://t.co/TKdgQwixwF",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "The United States Senate just passed the biggest in history Tax Cut and Reform Bill. Terrible Individual Mandate (O… https://t.co/uK5NUk2Ymo",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Congratulations to Paul Ryan, Kevin McCarthy, Kevin Brady, Steve Scalise, Cathy McMorris Rodgers and all great Hous… https://t.co/DjSHn7C6bL",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "A  story in the @washingtonpost that I was close to “rescinding” the nomination of Justice Gorsuch prior to confirm… https://t.co/wu6B3WTgX0",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Stocks and the economy have a long way to go after the Tax Cut Bill is totally understood and appreciated in scope… https://t.co/2BJwFD1CTu",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "DOW RISES 5000 POINTS ON THE YEAR FOR THE FIRST TIME EVER - MAKE AMERICA GREAT AGAIN!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Together, our task is to strengthen our families, to build up our communities, to serve our citizens, and to celebr… https://t.co/QsOYvl1MXs",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "With the strategy that I announced today, we are declaring that AMERICA is in the game and AMERICA is DETERMINED to… https://t.co/PCdvaFyy2D",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "70 Record Closes for the Dow so far this year! We have NEVER had 70 Dow Records in a one year period. Wow!",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Thank you Maria B! https://t.co/v1UR63CqLK",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "So true Ivanka! https://t.co/BNGUJG69Ki",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "As the world watches, we are days away from passing HISTORIC TAX CUTS for American families and businesses. It will… https://t.co/95522wIKVN",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "When the American People speak, ALL OF US should listen. Just over one year ago, you spoke loud and clear. On Novem… https://t.co/p8hGEg9j3v",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Over the past 11 months, I have travelled tens of thousands of miles, to visit 13 countries. I have met with more t… https://t.co/ZUveaJ7Hv2",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "Our deepest sympathies and most heartfelt prayers are with the victims of the train derailment in Washington State.… https://t.co/kPYFsuSKL7",
		"screen_name": "realDonaldTrump"
	},
	{
		"text": "My thoughts and prayers are with everyone involved in the train accident in DuPont, Washington. Thank you to all of… https://t.co/kw24I2Jm9t",
		"screen_name": "realDonaldTrump"
	}
]